src/Catalogs/УП_Индексы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УП_Индексы</Name>
			<Comment>Биржевые индексы с составом входящих активов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УП_ТипыИндексов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УП_БиржевыеИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/УП_Индексы/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ТаблицаЗаполненияСостава(Тикер, ТаблицаЗаполнения) Экспорт
	
	Возврат _ТаблицаЗаполненияСостава(Тикер, ТаблицаЗаполнения);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область _Описания

Функция _ИндексТикер()
    Возврат 2;
КонецФункции

Функция _ИндексВес()
    Возврат 5;
КонецФункции

#КонецОбласти

Функция _ТаблицаЗаполненияСостава(Тикер, ТаблицаЗаполнения)
	
	Результат = УП_ОбщегоНазначения.ОписаниеРезультата();
	
	ПараметрыЗапроса = Новый Структура;

	ТекущееСмещение = 0;
	ОбщееКоличество = -1;
	РазмерСтраницы  = 20;
	
	КлиентАпи = Обработки.УП_КлиентМосбиржи.Создать().Инит();

	Пока ТекущееСмещение < ОбщееКоличество Или ОбщееКоличество = -1 Цикл

		Если ОбщееКоличество <> -1 Тогда
			ПараметрыЗапроса.Вставить("start", ТекущееСмещение);
		КонецЕсли;

		ПорцияИндекса = КлиентАпи.ДанныеИндекса(Тикер, ПараметрыЗапроса);

		Если ПорцияИндекса.ПроизошлаОшибка Тогда
			Результат.ПроизошлаОшибка = Истина;
			Результат.ТекстОшибки = "Ошибка при получении данных индекса: " + ПорцияИндекса.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;

		ДанныеПорции = ПорцияИндекса.Данные.Получить("analytics");
		Если ДанныеПорции = Неопределено Тогда
			Результат.ПроизошлаОшибка = Истина;
			Результат.ТекстОшибки = "Ошибка: Отсутствует ключ 'analytics' в ответе сервера при получении данных индекса.";
			Возврат Результат;
		КонецЕсли;

		МассивПозиций = ДанныеПорции.Получить("data");
		Если МассивПозиций = Неопределено Тогда
			Результат.ПроизошлаОшибка = Истина;
			Результат.ТекстОшибки = "Ошибка: Отсутствует ключ 'data' в 'analytics' при получении данных индекса.";
			Возврат Результат;
		КонецЕсли;

		// Обновляем общее количество данных и текущее смещение после первой порции
		Если ОбщееКоличество = -1 Тогда
			КурсорДанные = ПорцияИндекса.Данные.Получить("analytics.cursor");
			Если КурсорДанные <> Неопределено И КурсорДанные.Получить("data").Количество() > 0 Тогда
				ОбщееКоличество = КурсорДанные.Получить("data")[0][1]; // TOTAL
				РазмерСтраницы = КурсорДанные.Получить("data")[0][2]; // PAGESIZE
			Иначе
				Результат.ПроизошлаОшибка = Истина;
				Результат.ТекстОшибки = "Ошибка: Не удалось получить данные курсора (TOTAL, PAGESIZE) при получении данных индекса.";
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Позиция ИЗ МассивПозиций Цикл
			// Проверяем тип и достаточное количество элементов, используя функции вместо констант
			Если ТипЗнч(Позиция) = Тип("ФиксированныйМассив") И Позиция.Количество() > _ИндексВес() Тогда
				
				ТикерИнструмента = Позиция[_ИндексТикер()];
				
				Инструмент = Справочники.УП_БиржевыеИнструменты.НайтиПоКоду(ТикерИнструмента);
				
				Если ЗначениеЗаполнено(Инструмент) Тогда
					НоваяСтрока = ТаблицаЗаполнения.Добавить();
					НоваяСтрока.Инструмент = Инструмент;
					НоваяСтрока.Вес        = Позиция[_ИндексВес()];
				КонецЕсли;
				
			Иначе
				Сообщить("Внимание: Некорректный формат позиции в данных индекса.");
			КонецЕсли;
		КонецЦикла;
		
		ТекущееСмещение = ТекущееСмещение + РазмерСтраницы;

	КонецЦикла;
	
	ТаблицаЗаполнения.Сортировать("Вес Убыв");
	
	Результат.Данные = ТаблицаЗаполнения;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
